import {IDataResponse} from "../models/models";

export const dataTime: IDataResponse = {
    header: "Исторические даты",
    time_periods: [{
        name: "Наука",
        year_events: [{
            year: 1992,
            description: "НАСА запускает космический аппарат Mars Observer для исследования Марса."
        }, {
            year: 1993,
            description: "Создание первого веб-браузера Mosaic, что ускорило развитие интернета."
        }]
    },
        {
        name: "Политика",
        year_events: [{
            year: 1994,
            description: "Палестино-израильское соглашение в Осло стало важным шагом к урегулированию ближневосточного конфликта."
        }, {
            year: 1996,
            description: "Вступление Китая в Всемирную торговую организацию."
        }, {
            year: 1995,
            description: "Подписание Дейтонского соглашения, которое положило конец гражданской войне в Боснии."
        }]
    }, {
        name: "Культура",
        year_events: [{
            year: 1997,
            description: "Выход книги Джоан Роулинг «Гарри Поттер и философский камень», которая стала глобальным феноменом."
        }, {
            year: 1999,
            description: "Запуск музыкальной платформы Napster, которая изменила способ распространения музыки."
        }, {
            year: 1998,
            description: "Премьера фильма «Титаник», который стал культовым и получил 11 Оскаров."
        }]
    }, {
        name: "Экономика",
        year_events: [{
            year: 2000,
            description: "Дотком-кризис: обвал технологического сектора акций в результате переоценки интернет-компаний."
        },  {
            year: 2002,
            description: "Китай становится второй по величине экономикой в мире после США."
        }, {
            year: 2001,
            description: "Создание Евро как полноценной валюты в безналичных расчетах."
        },{
            year: 2003,
            description: "Война в Ираке вызывает резкий скачок цен на нефть."
        }]
    }, {
        name: "Медицина",
        year_events: [{
            year: 2004,
            description: "Открытие генетической связи между мутациями в генах BRCA1/BRCA2 и развитием рака груди."
        }, {
            year: 2005,
            description: "Создание первой вакцины против ВПЧ (вируса папилломы человека)."
        }, {
            year: 2006,
            description: "Завершение проекта «Геном человека» и начало активных исследований в области персонализированной медицины."
        }]
    }, {
        name: "Технологии",
        year_events: [ {
            year: 2010,
            description: "NASA отправляет марсоход Curiosity на Марс для дальнейшего изучения планеты."
        }, {
            year: 2011,
            description: "Обнаружение бозона Хиггса на Большом адронном коллайдере стало важной вехой в физике частиц."
        }, {
            year: 2012,
            description: "Запуск SpaceX Dragon — первого частного космического аппарата, доставившего груз на Международную космическую станцию."
        }, {
            year: 2007,
            description: "Запуск iPhone компанией Apple, что стало началом новой эры смартфонов."
        }, {
            year: 2008,
            description: "SpaceX успешно запускает свою первую частную ракету Falcon 1."
        }, {
            year: 2009,
            description: "Извержение вулкана Эйяфьятлайокудль, что привело к массовым перебоям в авиации по всей Европе."
        }]
    }]
}